package com.company.homework.m2_1.task1;

/*Написать класс Circle по анологиии Rectangle и метод, который будет возвращать его площадь.*/

public class Task1Main {
    public static void main(String[] args) {
        Circle circle = new Circle(10.5);
        System.out.println("Square of circle: " + circle.square());

    }
}
